БухЭксп/Catalogs/CW_ШаблоныДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ШаблоныДокументов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.CW_ДоговорыПоГрузоперевозкам</xr:Item>
				<xr:Item>Catalog.CW_Грузоперевозки</xr:Item>
				<xr:Item>Catalog.CW_Заказы</xr:Item>
				<xr:Item>Catalog.CW_Заявки</xr:Item>
				<xr:Item>Catalog.CW_ПриложенияКДоговорам</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеШаблона</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРедактирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Создан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МасштабПечати</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МасштабПодписи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиКолонтитулов</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьКолонтитулы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ОбщиеШаблоныДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ОбщиеШаблоныДокументов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеШаблона</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеШаблона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МасштабПечати</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МасштабПодписи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиКолонтитулов</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьКолонтитулы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ШаблоныДокументов/Forms/ФормаРедактированияШаблонаMXL/Ext/Form/Module.bsl
// Хранит выбранные форматы сохранения файла договора

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Ключ.Пустая() Тогда
		Объект.Создан = ТекущаяДата();
	КонецЕсли;

	НазначениеШаблона = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(Объект.Владелец));
	РедактированиеМакросовДоступно 	= CW_ШаблоныДокументовСерверВызовСервера.ПолучитьПравоРедактированияШаблона(Объект.Ссылка, НазначениеШаблона); 

	Элементы.ПараметрыШаблонаИзменить.Видимость = РедактированиеМакросовДоступно;
 	Элементы.ПараметрыШаблонаКонтекстноеМенюИзменить.Видимость = РедактированиеМакросовДоступно;
  
	УстановитьДоступностьЭлементовФормы();
	
	УстановитьЗаголовокФормы();
	
	ХранилищеШаблона = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Ссылка, "ХранилищеШаблона");  
	Если ТипЗнч(ХранилищеШаблона) = Тип("ХранилищеЗначения") Тогда
		ТабличныйДокумент = ХранилищеШаблона.Получить(); 
	КонецЕсли; 
	
	НазначениеШаблона = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(Объект.Владелец));
	
	ИсходныеПечать  = CW_ШаблоныДокументовСерверВызовСервера.ПолучитьИсходныеРазмерыКартинкиXML(ТабличныйДокумент, "ПечатьОрганизации");  
	ИсходныеПодпись = CW_ШаблоныДокументовСерверВызовСервера.ПолучитьИсходныеРазмерыКартинкиXML(ТабличныйДокумент, "РуководительПодпись");
	
	ИсходныеПечатьШиринаВысота   = Новый ФиксированнаяСтруктура(ИсходныеПечать); 
	ИсходныеПодписьШиринаВысота  = Новый ФиксированнаяСтруктура(ИсходныеПодпись);
	
	УстановитьОтборСпискаПараметровШаблона();  
	
	ЕстьПодписьИлиПечать = ПровериьНаличиеПодписиИлиПечать();
	УстановитьВидимостьМасштаба(ЕстьПодписьИлиПечать); 
	
	//Настройки колонтитулов  
	Если Объект.ВыводитьКолонтитулы Тогда
		ТекущийОбъект 				= РеквизитФормыВЗначение("Объект");
		СвойстваКолонтитулов 		= ТекущийОбъект.НастройкиКолонтитулов.Получить();
		АдресНастроекКолонтитулов 	= ПоместитьВоВременноеХранилище(СвойстваКолонтитулов, УникальныйИдентификатор);  
		
		СброситьКолонтитулыНаСервере();
		УстановитьКолонтитулыНаСервере(СвойстваКолонтитулов);
	КонецЕсли;
	
	УстановитьВидимостьНастроекКолонтитула();
	//Настройки колонтитулов
	
КонецПроцедуры  

&НаСервере
Функция ПровериьНаличиеПодписиИлиПечать()
	
	ЕстьПодписьИлиПечать = Ложь;
	
	Если ТабличныйДокумент.Рисунки.Количество() > 0 Тогда 
		ИменаРисунков = CW_ШаблоныДокументовСерверВызовСервера.ПолучитьИменаРисунков();
		Для Каждого ИмяРисунка из ИменаРисунков Цикл
			Рисунок = CW_ШаблоныДокументовСерверВызовСервера.СуществуетКартикаМакета(ТабличныйДокумент,ИмяРисунка); 
			Если Рисунок <> Неопределено Тогда
				ЕстьПодписьИлиПечать = истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ЕстьПодписьИлиПечать;
	
КонецФункции 

&НаСервере
Процедура УстановитьВидимостьМасштаба(ЕстьПодписьИлиПечать)

	Элементы.ГруппаМасштаб.Видимость = ЕстьПодписьИлиПечать;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()

	РедактированиеДоступно = CW_ШаблоныДокументовСерверВызовСервера.ПолучитьПравоРедактированияШаблона(Объект.Ссылка, НазначениеШаблона);
	ТолькоПросмотр = Не РедактированиеДоступно; 
	
	Элементы.ПараметрыШаблона.Доступность  					= РедактированиеДоступно;
	Элементы.ТабличныйДокумент.Доступность 					= РедактированиеДоступно;
	//Элементы.ПараметрыШаблонаИзменитьПараметр.Доступность 	= РедактированиеДоступно;
	//Элементы.ПараметрыШаблонаДобавитьПараметр.Доступность 	= РедактированиеДоступно;
	Элементы.ФормаЗаполнитьИзШаблона.Доступность 			= РедактированиеДоступно;
	Элементы.Комментарий.Доступность 						= РедактированиеДоступно;
	Элементы.ГруппаПараметры.Видимость 						= РедактированиеДоступно;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	УстановитьЗаголовокФормы();

КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокФормы()
	
	Заголовок = СокрЛП(Объект.Ссылка)+?(Параметры.Ключ.Пустая(), СокрЛП(Объект.Владелец)+" (Создание шаблона)","");

КонецПроцедуры

&НаКлиенте
Процедура ПараметрыШаблонаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если CW_ШаблоныДокументовСерверВызовСервера.ЭтоГруппаПараметров(ВыбраннаяСтрока) Тогда
		Возврат;
	КонецЕсли;

	ИдентификаторПараметра = CW_ШаблоныДокументовСерверВызовСервера.ПолучитьИдентификаторПараметра(ВыбраннаяСтрока); 
	
	ВставитьПараметр(ИдентификаторПараметра);

КонецПроцедуры 

&НаКлиенте
Процедура ВставитьПараметр(Значение) 
	Модифицированность = Истина;
	
	мИменаРисунков = CW_ШаблоныДокументовСерверВызовСервера.ПолучитьИменаМакросовРисунков();
	Если мИменаРисунков.Найти(Значение) <> Неопределено Тогда
		ИмяКартинки = СтрЗаменить(Значение,"[","");
		ИмяКартинки = СтрЗаменить(ИмяКартинки,"]","");
		
		Рисунок = CW_ШаблоныДокументовКлиент.ПолучитьКартинкуТабличногоДокумента(ТабличныйДокумент, ИмяКартинки);
		Рисунок.Расположить(ТабличныйДокумент.ТекущаяОбласть);
		
		CW_ШаблоныДокументовКлиент.УстановитьРазмерыКартинкиXML(Рисунок, ИмяКартинки); 
		
		УстановитьВидимостьМасштаба(Истина);
	Иначе
		ТабличныйДокумент.ТекущаяОбласть.Текст 		= ТабличныйДокумент.ТекущаяОбласть.Текст + Значение;
		ТабличныйДокумент.ТекущаяОбласть.Заполнение	= ТипЗаполненияОбластиТабличногоДокумента.Текст;
	КонецЕсли;
	
КонецПроцедуры   

&НаКлиенте
Процедура ТабличныйДокументПриИзменении(Элемент)
	
	Модифицированность = Истина;

	ЕстьПодписьИлиПечать = ПровериьНаличиеПодписиИлиПечать();
	УстановитьВидимостьМасштаба(ЕстьПодписьИлиПечать);

КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	ТекущийОбъект.ХранилищеШаблона = Новый ХранилищеЗначения(ТабличныйДокумент, Новый СжатиеДанных(9));   
	
	ТекущийОбъект.ДатаРедактирования 	= ТекущаяДата();
	ТекущийОбъект.Пользователь 			= ПараметрыСеанса.ТекущийПользователь;  
	
	//Настройки колонтитулов
	СвойстваКолонтитулов = Неопределено;
	Если Объект.ВыводитьКолонтитулы 
		И ЭтоАдресВременногоХранилища(АдресНастроекКолонтитулов) Тогда
		СвойстваКолонтитулов = ПолучитьИзВременногоХранилища(АдресНастроекКолонтитулов);
	КонецЕсли;
	
	ТекущийОбъект.НастройкиКолонтитулов = Новый ХранилищеЗначения(СвойстваКолонтитулов);
	//Настройки колонтитулов
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзШаблона(Команда)    
	
	СтруктураОтбора = новый Структура;
	СтруктураОтбора.Вставить("ИмяФормата", "MXL");
	СтруктураОтбора.Вставить("НазначениеШаблона", НазначениеШаблона);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Отбор", СтруктураОтбора);      
	СтруктураПараметров.Вставить("МножественныйВыбор", Ложь);      
	СтруктураПараметров.Вставить("ЗакрыватьПриВыборе", Истина);   
	
	ОписаниеОповещения = новый ОписаниеОповещения("ВыборШаблонаЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.CW_ОбщиеШаблоныДокументов.ФормаВыбора", СтруктураПараметров, ЭтотОбъект,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры 

&наКлиенте
Процедура ВыборШаблонаЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт

	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;    
	
	Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
		Объект.Наименование = СокрЛП(РезультатВыбора);      
	КонецЕсли;
	
	ВыборШаблонаЗавершениенаСервере(РезультатВыбора);
	
КонецПроцедуры  

&НаСервере
Процедура ВыборШаблонаЗавершениенаСервере(РезультатВыбора)

	ХранилищеШаблона = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РезультатВыбора, "ХранилищеШаблона");  
	Если ТипЗнч(ХранилищеШаблона) = Тип("ХранилищеЗначения") Тогда
		ТабличныйДокумент = ХранилищеШаблона.Получить(); 
	КонецЕсли;     
	
	//Настройки колонтитулов  
	Если РезультатВыбора.ВыводитьКолонтитулы 
		И Не Объект.ВыводитьКолонтитулы Тогда
		
		ХранилищеКолонтитулов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РезультатВыбора, "НастройкиКолонтитулов");  
		Если ТипЗнч(ХранилищеКолонтитулов) = Тип("ХранилищеЗначения") Тогда
			
			НастройкиКолонтитулов 		= ХранилищеКолонтитулов.Получить();  
			Если  ТипЗнч(НастройкиКолонтитулов) = Тип("Структура") Тогда
				АдресНастроекКолонтитулов 	= ПоместитьВоВременноеХранилище(НастройкиКолонтитулов, УникальныйИдентификатор);
				Объект.ВыводитьКолонтитулы = Истина;  
				
				СброситьКолонтитулыНаСервере();
				УстановитьКолонтитулыНаСервере(НастройкиКолонтитулов);
			КонецЕсли;
		КонецЕсли;     
		
		УстановитьВидимостьНастроекКолонтитула();  
		
	КонецЕсли;
	//Настройки колонтитулов  
	
КонецПроцедуры

&НаКлиенте
Процедура Просмотр(Команда)  
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОбъектПечати", 	Объект.Владелец);
	ПараметрыФормы.Вставить("ШаблонДокумента", 	Объект.Ссылка);   
	
	ОткрытьФорму("ОбщаяФорма.CW_ФормаПросмотраТекстаДокументаMXL", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьСписокПоказателейШаблона" Тогда
		УстановитьОтборСпискаПараметровШаблона();
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьОтборСпискаПараметровШаблона() 
	
	ПараметрыШаблона.Отбор.Элементы.Очистить();

	НовыйЭлементОтбора = ПараметрыШаблона.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("НазначениеШаблона");
	НовыйЭлементОтбора.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
	НовыйЭлементОтбора.ПравоеЗначение 	= НазначениеШаблона;
	НовыйЭлементОтбора.Использование 	= Истина;
	
КонецПроцедуры    

&НаКлиенте
Процедура ПараметрыШаблонаНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	Если CW_ШаблоныДокументовСерверВызовСервера.ЭтоГруппаПараметров(ПараметрыПеретаскивания.Значение) Тогда
		Возврат;
	КонецЕсли;

	ИдентификаторПараметра = CW_ШаблоныДокументовСерверВызовСервера.ПолучитьИдентификаторПараметра(ПараметрыПеретаскивания.Значение); 
 	ПараметрыПеретаскивания.Значение = ИдентификаторПараметра;

КонецПроцедуры

&НаКлиенте
Процедура ПараметрыШаблонаПередНачаломИзменения(Элемент, Отказ)
	Отказ = Не РедактированиеМакросовДоступно;
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыШаблонаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура МасштабПечатиПриИзменении(Элемент) 
	
	CW_ШаблоныДокументовКлиент.ИзменитьМасштабКартинкиXML(ТабличныйДокумент, "ПечатьОрганизации", ИсходныеПечатьШиринаВысота, Объект.МасштабПечати);
	   
КонецПроцедуры

&НаКлиенте
Процедура МасштабПечатиОчистка(Элемент, СтандартнаяОбработка)   
	
	СтандартнаяОбработка = Ложь;	
	Объект.МасштабПечати = 100;
	CW_ШаблоныДокументовКлиент.ИзменитьМасштабКартинкиXML(ТабличныйДокумент, "ПечатьОрганизации", ИсходныеПечатьШиринаВысота, Объект.МасштабПечати);     
	
КонецПроцедуры

&НаКлиенте
Процедура МасштабПодписиПриИзменении(Элемент)

	CW_ШаблоныДокументовКлиент.ИзменитьМасштабКартинкиXML(ТабличныйДокумент, "РуководительПодпись", ИсходныеПодписьШиринаВысота, Объект.МасштабПодписи);
	
КонецПроцедуры    

&НаКлиенте
Процедура МасштабПодписиОчистка(Элемент, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь;	
	Объект.МасштабПодписи = 100;
	CW_ШаблоныДокументовКлиент.ИзменитьМасштабКартинкиXML(ТабличныйДокумент, "РуководительПодпись", ИсходныеПодписьШиринаВысота, Объект.МасштабПодписи); 
	
КонецПроцедуры

//Настройки колонтитулов
&НаКлиенте
Процедура ВыводитьВерхнийКолонтитулПриИзменении(Элемент)
	УстановитьВидимостьНастроекКолонтитула(); 

	Если НЕ Объект.ВыводитьКолонтитулы тогда
		СброситьКолонтитулыНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьНастроекКолонтитула()
	
	Элементы.ОткрытьНастройкиКолонтитулов.Видимость =  Объект.ВыводитьКолонтитулы;  
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиКолонтитулов(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьНастройкуКолонтитулов", ЭтотОбъект);
	
	СтруктураПараметров = Новый Структура;  
	Если ЭтоАдресВременногоХранилища(АдресНастроекКолонтитулов) Тогда
		Настройки = ПолучитьИзВременногоХранилища(АдресНастроекКолонтитулов);
	КонецЕсли;
	СтруктураПараметров.Вставить("Настройки", Настройки);
	
	ОткрытьФорму("ОбщаяФорма.НастройкаКолонтитулов", СтруктураПараметров, ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);   
	
КонецПроцедуры       

&НаКлиенте
Процедура ЗавершитьНастройкуКолонтитулов(Настройки, ДополнитлеьныеПараметры) Экспорт
	
	Если Настройки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СброситьКолонтитулыНаСервере();
	УстановитьКолонтитулыНаСервере(Настройки);

	АдресНастроекКолонтитулов = ПоместитьВоВременноеХранилище(Настройки, УникальныйИдентификатор);
	
	Модифицированность 			= Истина;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьКолонтитулыНаСервере(СвойстваКолонтитулов)
  
   	Если Не КолонтитулУстановлен(СвойстваКолонтитулов.ВерхнийКолонтитул)
		И Не КолонтитулУстановлен(СвойстваКолонтитулов.НижнийКолонтитул) Тогда
		Возврат;
	КонецЕсли;

	//УправлениеКолонтитулами
	УправлениеКолонтитулами.УстановитьКолонтитулы(ТабличныйДокумент,,,СвойстваКолонтитулов);
	//УправлениеКолонтитулами

КонецПроцедуры  

&НаСервере
Функция КолонтитулУстановлен(Колонтитул)
	Возврат ЗначениеЗаполнено(Колонтитул.ТекстСлева)
		Или ЗначениеЗаполнено(Колонтитул.ТекстВЦентре)
		Или ЗначениеЗаполнено(Колонтитул.ТекстСправа);
КонецФункции
	
&НаСервере
Процедура СброситьКолонтитулыНаСервере()
	
	СброситьКолонтитул(ТабличныйДокумент.ВерхнийКолонтитул);
	СброситьКолонтитул(ТабличныйДокумент.НижнийКолонтитул);

КонецПроцедуры

&НаСервере
Процедура СброситьКолонтитул(Колонтитул) 

	Колонтитул.ТекстСлева = "";
	Колонтитул.ТекстВЦентре = "";
	Колонтитул.ТекстСправа = "";

КонецПроцедуры
//Настройки колонтитулов
